export enum EMenues {
    MAIN_MENU = `Головне меню:
1. ВР
2. Фракція
3. Депутат

0. Вихід`,
    VR_MENU = `ВР Меню:

1. Додати фракцію
2. Додати депутата у фракцію
3. Показати депутата
4. Показати фракцію
5. Показати найбільшого хабарника ради
6. Показати найбільшого хабарника фракції
7. Показати всіх депутатів ради
8. Показати всі фракції
9. Показати всіх хабарників ради
10. Видалити фракцію
11. Видалити депутата з фракції
12. Видалити всіх хабарників
13. Видалити всі фракції
14. Видалити всіх депутатів ради

0. До головного меню`,
    FRACTION_MENU = `Меню Фракції:

1. Додати депутата
2. Показати депутата
3. Показати всіх депутатів
4. Показати найбільшого хабарника фракції
5. Показати всіх хабарників фракції
6. Видалити всіх хабарників фракції

0. До головного меню`,
    DEPUTAT_MENU = `Меню депутата:

1. Новий депутат
2. Дати хабаря депутату
3. Скільки нажив на хабарях

0. До головного меню`,
}