////====================================== HOME WORK 7 =================================================================

////=========================== 1 ======================================================================================
// - Создать произвольный елемент с id = text.
// Используя JavaScript, сделайте так, чтобы при клике на кнопку исчезал элемент с id="text".

let hideTestBTN = document.querySelector('.test-and-button button');

// hideTestBTN.addEventListener('click', () => {
//     document.getElementById('test').style.display = 'none';
// });

hideTestBTN.onclick = () => {
    document.getElementById('test').style.display = 'none';
};

////=========================== 2 ======================================================================================
//     - Создайте кнопку, при клике на которую, она будет скрывать сама себя.

let hiddenBTN = document.querySelector('.hidden-button button');

hiddenBTN.onclick = () => {
    hiddenBTN.style.display = 'none';
};

////=========================== 3 ======================================================================================
// - створити інпут який приймає вік людини та кнопку яка підтверджує дію.
// При натисканні на кнопку зчитати інформацію з інпуту та перевірити вік чи меньше він ніж 18,
// та повідомити про це користувача

let verifyBTN = document.querySelector('.input-age button');

verifyBTN.addEventListener('click', () => {
    let age = +(document.getElementById('age').value);
    if (age < 0) {
        alert('Realy?');
    } else if (age < 18) {

        alert('Sorry! 18+ only!');
    } else {
        alert('Wellcome!');
    }
});

////=========================== 3 ======================================================================================
// - Создайте меню, которое раскрывается/сворачивается при клике

let menu = document.querySelector('.menu-hidden');

menu.addEventListener('click', (ev) => {
    if (ev.target === menu.children[0]) {
        (menu.children[1].classList.contains('hidden'))
            ? menu.children[1].classList.remove('hidden')
            : menu.children[1].classList.add('hidden');
    }
});

////=========================== 4 ======================================================================================
// - Создать список комментариев , пример объекта коментария - {title : 'lorem', body:'lorem ipsum dolo sit ameti'}.
//     Вывести список комментариев в документ, каждый в своем блоке.
//     Добавьте каждому комментарию по кнопке для сворачивания его body.



// - створити 2 форми  по 2 інпути в кожній. ствоирити кнопку при кліку на яку считується та виводиться на консоль інформація з цих 2х форм.
//     Кнопка повинна лежати за межами форм (Щоб ьуникнути  перезавантаження сторінки)
// Доступ до інпутів через Forms API. Отже дайте формі та інпутам всі необхідні атрибути.
//
// - Створити функцію, яка генерує таблицю.
//     Перший аргумент визначає кількість строк.
//     Другий параметр визначає кліькіть ячеєк в кожній строці.
//     Третій параметр визначає елемент в який потрібно таблицю додати.