////=================================================== HOME WORK 4 ====================================================

////=================================================== 1 ==============================================================

// // - створити функцію яка виводить масив
//
// function showArray(array) {
//     for (const el of array) {
//         console.log(el);
//     }
// }
//
////=================================================== 2 ==============================================================

// // - створити функцію яка заповнює масив рандомними числами та виводить його. Для виведення використати попвередню функцію.
//
// function randArray() {
//     let arr = [];
//     for (let i = 0; i < 10; i++) {
//         arr.push(+(Math.random() * 100).toFixed(0));
//     }
//     showArray(arr);
// }
//
// randArray();
//
////=================================================== 3 ==============================================================

// // - створити функцію яка приймає три числа та виводить та повертає найменьше.
//
// function min(a, b, c) {
//     let number = Math.min(a, b, c);
//     console.log(number);
//     return number;
// }
//
// min(1, 3, -10);
//
////=================================================== 4 ==============================================================

// // - створити функцію яка приймає три числа та виводить та повертає найбільше.
//
// function max(a, b, c) {
//     let max = Math.max(a, b, c);
//     console.log(max);
//     return max;
// }
//
// max(4, 5, 2);
//
////=================================================== 5 ==============================================================
//
// // // - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
//
// function minMax() {
//     let min = Math.min(...arguments);
//     let max = Math.max(...arguments);
//     console.log(max);
//     return min;
// }
//
// console.log(minMax(1, 2, 2, 3, 4, 5, 6, 7, 8, 9, 10));

////=================================================== 6 ==============================================================
//
// // - створити функцію яка виводить масив
//
// function createArray(n) {
//     let arr = [];
//     for (let i = 0; i < n; i++) {
//         arr.push(+(Math.random() * 100).toFixed(0));
//     }
//     return arr;
// }
//
// let testArray = createArray(10);
// console.log(testArray);
//
// ////=================================================== 7 ==============================================================
//
// // - створити функцію яка повертає найбільше число з масиву
//
// function maxInArray(array) {
//     return Math.max(...array);
// }
//
// console.log(maxInArray(testArray));
//
// ////=================================================== 8 ==============================================================
//
// // - створити функцію яка повертає найменьше число з масиву
//
// function minInArray(array) {
//     return Math.min(...array);
// }
//
// console.log(minInArray(testArray));
//
// ////=================================================== 9 ==============================================================
//
// // - створити функцію яка приймає масив чисел та складає значення елементів масиву та повертає його.
//
// function sumArray(array) {
//     let sum = 0;
//     for (const num of array) {
//         sum += num;
//     }
//     return sum;
// }
//
// console.log(sumArray(testArray));
//
// ////=================================================== 10 ==============================================================
//
// // - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
//
// function averageArray(array) {
//     let sum = 0;
//     for (const num of array) {
//         sum += num;
//     }
//     return sum / array.length;
// }
//
// console.log(averageArray(testArray));
//
// ////=================================================== 11 ==============================================================
//
// // - Створити функцію яка приймає масив будь яких объектів, та повертає значення кількості об'єктів в масиві
//
// function lengthObjArr(arrayOfObjs) {
//     return arrayOfObjs.length;
// }
//
// ////=================================================== 12 ==============================================================
//
// // - Створити функцію яка приймає масив будь яких объектів, та повертає загальн кількість полів в них
//
// function sumPropertiesObjArr(arrOfObjs) {
//     let sum = 0;
//     for (const obj of arrOfObjs) {
//         sum += Object.keys(obj).length;
//     }
//     return sum;
// }

////=================================================== 13 ==============================================================

// // - створити функцію  яка скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
// //     Приклад
// let ar1 = [1, 2, 3, 4];
// let ar2 = [2, 3, 4, 5];
// // результат
// //     [3,5,7,9]
//
// function arraysSumator(arr1, arr2) {
//     let resArr = [];
//     for (let i = 0; i < arr2.length; i++) {
//         resArr.push(arr1[i] + arr2[i]);
//     }
//     return resArr;
// }
//
// console.log(arraysSumator(ar1, ar2));

////=================================================== 14 ==============================================================

// // - *** приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//
// function replaceObj(arrObj, i) {
//     let rep = arrObj[i];
//     arrObj[i] = arrObj[i + 1];
//     arrObj[i + 1] = rep;
// }

////=================================================== 15 ==============================================================

// - *** створити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// Приклад
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]

let testZeros = [0,0,1,0];

console.log(testZeros);

zeroToEndArr(testZeros);

console.log(testZeros);

function zeroToEndArr(array) {
    let zeros = [];
    for (let i = 0; i < array.length; i++) {
        if(!array[i]){
            let splice = array.splice(i, 1);
            zeros.push(...splice);
            i--;
        }
    }
    if (zeros.length > 0) {
        array.push(...zeros);
    }
}

////=================================================== 16 ==============================================================

